<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>

<title>H - The Daily Worldwide Enquiring Times-Journal Examiner</title>

<meta name="description" content="H - The Daily Worldwide Enquiring Times-Journal Examiner" />
<meta name="keywords" content="News" />
<meta name="copyright" content="Copyright 2006">

<link rel="Shortcut Icon" type="image/ico" href="http://bakiwop.f2o.org/h.ico" />

<link rel="stylesheet" type="text/css" media="screen" href="screen.css" />
<link rel="stylesheet" type="text/css" media="print" href="print.css" />

</head>
<body>
<div id="h"><a class="none" href="h.html">H</a></div>
<div id="words">

<h4>ARTICLES</h4>
<span class="smaller">
<a href="000039.html" title="Bush: U.S. willing to strike first">39</a> 
<a href="000038.html" title="Christian Scientist Pharmacist Sues Walgreens">38</a> 
<a href="000037.html" title="RIAA Sues Pope/Pope Excommunicates RIAA">37</a> 
<a href="000036.html" title="Bush: Outsourcing painful, but remedy is worse">36</a> 
<a href="000035.html" title="Man Sells Holy Hardware on eBay">35</a> 
<a href="000034.html" title="South Dakota lawmakers OK ban on most abortions">34</a> 
<a href="000033.html" title="Bush: 'Godfather' Says Open Ports to U.A.E.">33</a> 
<a href="000032.html" title="Enron Trial Underway">32</a> 
<a href="000031.html" title="212 face Katrina fraud charges">31</a> 
<a href="000030.html" title="Cheney Shoots Man">30</a> 
<a href="000029.html" title="Microsoft, Google Settle Over Employee">29</a> 
<a href="000028.html" title="Olympic Committee:  Late Bribe Could've Tipped Tables">28</a> 
<a href="000027.html" title="Bush and Rumsfeld - Whoopsee Daisy">27</a> 
<a href="000026.html" title="Bush: Secret wiretaps have disrupted potential attacks">26</a> 
<a href="000025.html" title="Bush: The War Is Not Lost">25</a> 
<a href="000024.html" title="Syrian Leader: WTF U.S.?">24</a> 
<a href="000023.html" title="Ancient Self-Help Book Found">23</a> 
<a href="000022.html" title="Bowling for America">22</a> 
<a href="000021.html" title="Kansas Schools To Teach Intelligent Numbers">21</a> 
<a href="000020.html" title="New Scientific Study: Breathe Air And Die">20</a> 
<a href="000019.html" title="Army  To Troops: BYOB">19</a> 
<a href="000018.html" title="It's An Honor To Be Your Honor When...">18</a> 
<a href="000017.html" title="John Roberts Sworn at as 17th Chief Justice">17</a> 
<a href="000016.html" title="Hurricanes Pissing People Off">16</a> 
<a href="000015.html" title="IMF clears deal to erase poor nations  debt">15</a> 
<a href="000014.html" title="School Expels Girl for Having Gay Parents">14</a> 
<a href="000013.html" title="Shorts: 25 September 2005">13</a> 
<a href="000012.html" title="G-8 Leaders: Global Warming Is Public Enemy No. 1">12</a> 
<a href="000011.html" title="Joint DEA/FBI Sting Takes Down $104 Billion NASA Drug Ring">11</a> 
<a href="000010.html" title="Mobile Home Industry Waiting on FEMA">10</a> 
<a href="000009.html" title="Poor Farmers Are Weak Link In Bird Flu Flight">9</a> 
<a href="000008.html" title="These Caucasians Are Wonderful!">8</a> 
<a href="000007.html" title="You Say Evacuee, I Say Refugee, Let's Call The Whole Thing Off">7</a> 
<a href="000006.html" title="Bush: 'Bankruptcy Abuse Prevention and Consumer Protection Act of 2005' for a Stronger America">6</a> 
<a href="000005.html" title="Bush to Americans: It's Not About Race">5</a> 
<a href="000004.html" title="Porn Industry Hurt By Katrina, Even Masochists Unhappy">4</a> 
<a href="000003.html" title="GOP Leaders Seek to Deflect Katrina Outcry With Probe">3</a> 
<a href="000002.html" title="Clobbered Comet Hires Ghost of Johnny Cochran for Lawsuit">2</a> 
<a href="000001.html" title="Bush Tours Hurricane-Battered Gulf Coast">1</a> 
<a href="000000.html" title="Government Kontracts Kitten to Katch Osama">0</a> 
<a href="999999.html" title="Introduction from the Editor-in-Chief">-1</a> 
</span>
<br /><br /><br />





"The World's First, Best, Most Accurate, And Only Daily Newspaper" - <span class="logo">H</span> is <em>The Daily Worldwide Enquiring Times-Journal Examiner</em>.
<br /><br />
If the news is not good enough, we will make it better.  If the news is not good at all, we will make it up.

<br /><br /><br />
<h4>MISSION STATEMENT</h4>
$


<br /><br /><br />
<h4>EDITORS</h4>
<strong>Editor-in-Chief: Guy McSandersFellowsonchildbraham</strong>
<blockquote>Guy McSandersFellowsonchildbraham was raised on a banana plantation in Betws-y-Coed, Wales.  At the age of 13 he joined the French Foreign Legion as a field correspondent for the <em>The French Foreign Legion Weekly Shopper</em> and wrote over 350 columns during his 5 year tour-of-duty despite not knowing a single word of French.  After going AWOL in the Legion, Guy joined the staff of the <em>Singapore Semi-Daily</em> as a brothel columnist - a post he held until joining the staff at <em>The Daily Worldwide Enquiring Times-Journal Examiner</em> as editor-in-chief.  Guy is fluent in Welsh, Gaelic and Flemmish.</blockquote>
<br />
<strong>Terrestrial Editor: Ang&eacute;l&iacute;n&aacute; M&oacute;l&iacute;n&aacute; Ch&iacute;q&uacute;&iacute;t&aacute; &Aacute;l&oacute;nz&oacute; R&uacute;d&oacute;lph&oacute; C&uacute;&eacute;rv&oacute; D&oacute;s&Eacute;q&uacute;&iacute;s M&aacute;rq&uacute;&eacute;z</strong>
<blockquote>Ang&eacute;l&iacute;n&aacute; M&oacute;l&iacute;n&aacute; Ch&iacute;q&uacute;&iacute;t&aacute; &Aacute;l&oacute;nz&oacute; R&uacute;d&oacute;lph&oacute; C&uacute;&eacute;rv&oacute; D&oacute;s&Eacute;q&uacute;&iacute;s M&aacute;rq&uacute;&eacute;z was born into the Swedish mobster family, the Svenska Sjukdom.  Her mother, an Icelandic Gypsy who was catering a potluck dinner thrown by the godfather of the Svenska Sjukdom family, met her father, an Arabian-Finnish-Cherokee who was emceeing the event, in 1958.  The godfather, Mattias "The Frozen One" Balthazar, noticed the attraction between the two and immediately had them beaten into the family. Ang&eacute;l&iacute;n&aacute; M&oacute;l&iacute;n&aacute; Ch&iacute;q&uacute;&iacute;t&aacute; &Aacute;l&oacute;nz&oacute; R&uacute;d&oacute;lph&oacute; C&uacute;&eacute;rv&oacute; D&oacute;s&Eacute;q&uacute;&iacute;s M&aacute;rq&uacute;&eacute;z was born 4 months later and has been editing periodicals ever since.</blockquote>
<br />
<strong>Extraterrestrial Editor: Biff</strong>
<blockquote>Biff was first abducted by aliens when his mother, then 5 months pregnant with him, was taken aboard a Zarkadian mothership for scientific research purposes.  Since then, he has been abducted 642 times but has managed to never be late for work or miss an editorial deadline.</blockquote>


<br /><br /><br />
<h4>COLUMNISTS</h4>
<strong>Dick Thourghood</strong>
<blockquote>After being rejected by <em>National Geographic</em>, <em>Time</em>, <em>U.S. News and World Report</em>, <em>The Los Angeles Times</em>, <em>The New York Post</em>, the <em>Poughkeepsie Journal</em>, and <em>The National Enquirer</em>, Dick decided to join the staff of <em>The Daily Worldwide Enquiring Times-Journal Examiner</em> as a beat reporter.</blockquote>
<br />
<strong>Sandhya Kunavarasaji</strong>
<blockquote>Sandya studied astrophysics at Horvard, Yele and Cumbridge before finally receiving a Ph.E. in Astrology from the Ricky Salens College of Astrocosmological Studies and Cosmetology.  Sandhya does horoscopes for <em>The Daily Worldwide Enquiring Times-Journal Examiner</em>.</blockquote>
<br />
<strong>William Two Bears Haroldson</strong>
<blockquote>Billy lives as a hermit in central Montana.  He carves his big city metro reports onto blocks of balsa wood and sends them to <em>The Daily Worldwide Enquiring Times-Journal Examiner</em> by courier pigeon.</blockquote>
<br />
<strong>Jimmy the Pirate</strong>
<blockquote>With three weeks of community college under his belt, Jimmy the Pirate is the most legitimately educated staffmember of <em>The Daily Worldwide Enquiring Times-Journal Examiner</em>, a fact of which he is very proud.  Jimmy the Pirate does reporter-type things.</blockquote>
<br />
<strong>Billy Bob Bubba Hotep</strong>
<blockquote>Billy is a Mississippi Egyptian who has been married 14 times, has 27 children, drinks heavily at social occassions, drinks heavily in his pickup truck which doubles as his transportation <em>and</em> residence, and drinks heavily in the offices of <em>The Daily Worldwide Enquiring Times-Journal Examiner</em> where he does the advice column.</blockquote>
<br />
<strong>Monique Leveque</strong>
<blockquote>Monique studied fashion under Tom Ford, Donna Karan, Ralph Lauren, and Donatella Versace as a gofer.  Her favorite television show is <em>Friends</em> and she once saw Eddie Murphy at a gas station.  Monique reports on fashion and celebrity news for <em>The Daily Worldwide Enquiring Times-Journal Examiner</em>.</blockquote>
<br />
<strong>Xi Xiang</strong>
<blockquote>Xiang began life as a poor peasant girl from the wilds of China's Gobi Desert.  She came to America as a mail-order bride and cannot read or write. Xiang does <em>The Daily Worldwide Enquiring Times-Journal Examiner</em> crosswords and jumbles.</blockquote>
<br />
<strong>Tim Smith</strong>
<blockquote>Tim has been fascinated by aliens ever since the social worker at his orphanage told him his mother, father, 3 brothers and 5 sisters were abducted when he was 2.  The aliens did not take him and he hasn't seen his family since.  Tim has never seen an alien or u.f.o. but would really really like to.  He does the paranormal column for <em>The Daily Worldwide Enquiring Times-Journal Examiner</em></blockquote>
<br />
<strong>Hans Gr&uuml;ber Christensen Anders</strong>
<blockquote>Hans Gr&uuml;ber Christensen Anders is not German.</blockquote>
<br />


<br /><br />
<h4>FREQUENCY</h4>
<em>The Daily Worldwide Enquiring Times-Journal Examiner</em> is published daily once, twice, or sometimes even three times every week or so.


<br /><br /><br />
<h4>CIRCULATION</h4>
With a potential circulation of over 6 billion terrestrial humanoids, 1.2 billion subterranean Martians, 185 million Jovians, 455,000 intra-solar-system extraterrestrials, and 78 trillion extra-solar-system extraterrestrials in this universe alone, <em>The Daily Worldwide Enquiring Times-Journal Examiner</em> could, potentially, reach a lot of living creatures.


<br /><br /><br />
<h4>PRICE</h4>
<em>The Daily Worldwide Enquiring Times-Journal Examiner</em> costs $10.95USD to be paid right now, every single time you come to the site, refresh a page, think about it, tell someone else about it, or breathe. So pay us now. Now! Do it!


<br /><br /><br />
<h4>SUBMISSIONS</h4>
Have a great story idea?  Taken an interesting photograph?  Shot some amazing video?  If you would like to send us your submissions and receive absolutely no monetary reward or recognition, <a href="mailto:newspaperh@gmail.com">get in touch</a>.


<br /><br /><br />
<h4>CONTACT</h4>
What - you didn't see the email address above?  Pay attention! We don't really like hearing from people - even if you think you know us or want to send us praise we really don't want to hear from you.  <a href="mailto:newspaperh@gmail.com">Go away.</a>


<br /><br /><br />
<h4>THANKS</h4>
Special thanks go to <a href="http://www.squidaction.com">Pat</a> for not designing the logo and bakiwop for providing the hosting at his website which he doesn't actually use or pay money for in the first place.







</div>
</body>
</html>